# Connecting iPython to BigQuery
This notebook provides an example of how to connect to Google BigQuery and execute simple queries

First install the necessary Python packages. For the purposes of this notebook we require the official [Google Cloud BigQuery library](https://googleapis.github.io/google-cloud-python/latest/bigquery/index.html) including `pandas` support

In [ ]:
! pip3 install --upgrade pip
! pip3 install --upgrade google-cloud-bigquery[pandas]

In [1]:
# Import all necessary modules
from google.cloud import bigquery
from google.cloud.bigquery import magics
# from google.oauth2 import service_account

For authentication purposes, create a service account and ensure that the service account can access the BigQuery datasets that you will be querying. Download the service account's credentials, place them in the same directory as this notebook, and rename the json file to `credentials.json`

In [2]:
# Set configuration options
CREDENTIALS_PATH = 'credentials.json'

The BigQuery Python client library provides a magic command that 
allows you to run queries with minimal code. Before you load the magic you will also need to provide your service account's authentication details

In [3]:
%env GOOGLE_APPLICATION_CREDENTIALS={CREDENTIALS_PATH}

# Load the bigquery magic
%load_ext google.cloud.bigquery

env: GOOGLE_APPLICATION_CREDENTIALS=credentials.json

Now let's run a simple query (accessing one of the public datasets). The output is a Pandas dataframe.

In [7]:
%%bigquery
SELECT
    source_year AS year,
    COUNT(is_male) AS birth_count
FROM `bigquery-public-data.samples.natality`
GROUP BY year
ORDER BY year DESC
LIMIT 15

    year  birth_count
0   2008      4255156
1   2007      4324008
2   2006      4273225
3   2005      4145619
4   2004      4118907
5   2003      4096092
6   2002      4027376
7   2001      4031531
8   2000      4063823
9   1999      3963465
10  1998      3945192
11  1997      3884329
12  1996      3894874
13  1995      3903012
14  1994      3956925

If you want to save the resulting dataframe so that you can manipulate it to your needs, add a variable name to the `%%bigquery` command

In [8]:
%%bigquery annual_birth_count
SELECT
    source_year AS year,
    COUNT(is_male) AS birth_count
FROM `bigquery-public-data.samples.natality`
GROUP BY year
ORDER BY year DESC
LIMIT 15

In [13]:
# Utilise the dataframe variable
print('The shape of the dataframe is {}'.format(annual_birth_count.shape))
annual_birth_count

The shape of the dataframe is (15, 2)

    year  birth_count
0   2008      4255156
1   2007      4324008
2   2006      4273225
3   2005      4145619
4   2004      4118907
5   2003      4096092
6   2002      4027376
7   2001      4031531
8   2000      4063823
9   1999      3963465
10  1998      3945192
11  1997      3884329
12  1996      3894874
13  1995      3903012
14  1994      3956925